Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: Normally, you don’t need to be aware of the difference between concrete and existential metatypes, but calling type(of:) can yield unexpected results in a generic context with a type parameter bound to a protocol.
ja: 通常、あなたは具象と存在のメタタイプの間の違いを意識する必要はありません、しかしtype(of:)を呼び出すことは、あるプロトコルに束縛された型パラメータを伴うある総称体の文脈において予期しない結果を生み出すことができます。

source: Note
ja: 注意

source: Note Renamed Reference Types
ja: 改名される参照型に注意してください

source: Note that AnyHashable does not guarantee that it preserves the hash encoding of wrapped values.
ja: 注意してください、AnyHashableは、それがそのラップされた値のハッシュ符号化を保全することを保証しません。

source: Note that Float80.significandBitCount is 63, even though 64 bits are used to store the significand in the memory representation of a Float80 (unlike other floating-point types, Float80 explicitly stores the leading integral significand bit, but the BinaryFloatingPoint APIs provide an abstraction so that users don’t need to be aware of this detail).
ja: Float80.significandBitCountは63であることに注意してください、64ビットが使用されて仮数をFloat80メモリ表現に格納するとしてもです（他の浮動小数点型と違い、Float80は明示的に先頭整数仮数ビットを格納します、しかしBinaryFloatingPointAPIはある抽象化を提供します、それでユーザはこの詳細に通じている必要はありません）。

source: Note that q is not x / y computed in floating-point arithmetic, and that q may not be representable in any available integer type.
ja: qが浮動小数点算術で計算されるx / yではないこと、そしてqは何らかの利用可能な整数型において表現可能でないかもしれないことに注意してください

source: Note that in this example, imagePaths is subscripted using a dictionary index.
ja: この例において、imagePathsが辞書インデックスを使って添え字をすることに注意してください。

source: Note that some elements in the temperatureData array are not valid numbers.
ja: temperatureData 配列の幾つかの要素は有効な数字ではないことに注意してください。

source: Note that the > operator provided by the standard library is used in this example, not the < operator implemented above.
ja: 標準ライブラリによって提供される>演算子がこの例で使われることに注意してください、上で実装される<演算子ではなしに。

source: Note that the inout exclusivity rules mean that, like any other inout argument, value cannot be directly accessed by other code for the duration of body.
ja: inout排他規則が意味することに注意してください、何か他のinoutと同様に、valueはbodyの継続期間には他のコードによって直接にアクセス可能ではありません。

source: Note that the value may not be preserved, particularly when converting between signed to unsigned integer types or when the destination type has a smaller bit width than the source type.
ja: 注意すべきはその値が保たれないかもしれないことです、とりわけ符号付きから符号なし整数型への間の変換の場合、または行先の型が元の型より小さなビット幅を持つ場合には。

source: Note: transacting upon the remaining count is only valid when then calls to yield are mutually exclusive.
ja: 注意：残りの総数に関して取引（トランザクト）をすることは、生み出すためのその後の呼び出しそれらが互いに排他的である場合に有効であるだけです。

source: Notice that the removeItem(at:) method is imported by Swift with a Void return type, no error parameter, and a throws declaration.
ja: removeItem(at:)メソッドが、スウィフトによってVoidの戻り型で、errorパラメーターなしで、そしてthrows宣言でインポートされることに注意してください。

source: Notify objects about changes to the properties of other objects.
ja: 他のオブジェクトのプロパティに対する変更についてオブジェクトに通知します。

source: Now suppose you have an array of addresses that you need to check for a particular address.
ja: 今あなたがいくらかの住所からなる配列、あなたがある特定の住所を確認する必要があるものを持つと仮定します。

source: Now that Date conforms to Comparable, you can compare instances of the type with any of the relational operators.
ja: 今やDateはComparableに準拠します、あなたはこの型のインスタンスを関係演算子のどれででも比較できます。

source: Now that GridPoint conforms to the Hashable protocol, you can create a set of previously tapped grid points.
ja: GridPointがHashableプロトコルに準拠する今、あなたは以前にタップされた格子点の集合を作成することができます。

source: Now that the shorterIndices array holds the indices of the shorter names in the names set, you can use those indices to access elements in the set.
ja: 現在、shorterIndices配列はnames集合の中のより短い名前のインデックスを保持します、あなたはそれらのインデックスを使ってこの集合の要素にアクセスできます。

source: Numbers and Basic Values
ja: 数と基本的な値

source: Numbers, Data, and Basic Values
ja: 数、データ、そして基本的な値

source: Numeric Protocols
ja: 数に関するプロトコル

source: Numeric Values
ja: 数値

source: Objective-C APIs
ja: Objective-C API

source: Objective-C and C Code Customization
ja: Objective-CとCコードのカスタム化

source: Objective-C classes qualified by one or more protocols, like the one in the example below, are imported by Swift as protocol composition types.
ja: 下の例でのもののような、１つ以上のプロトコルによる基準を満たすObjective-Cクラスは、スウィフトによってプロトコル合成型としてインポートされます。

source: Objective-C exception handling uses the @try, @catch, and @throw syntax to indicate unrecoverable programmer errors.
ja: Objective-C例外処理は、@try、@catch、そして@throw構文を使って回復不可能なプログラマエラーを指し示します。

source: Objective-C reference type
ja: Objective-C参照型

source: Objective-C type declarations that use lightweight generic parameterization are imported by Swift with information about the type of their contents preserved.
ja: 軽量総称体パラメーター化を使うObjective-C宣言は、それらの保管される内容についての情報を使ってスウィフトによってインポートされます。

source: Objects that are set up to use key-value observing—such as observed above—notify their observers about property changes.
ja: キー値監視を使うように設定されるそれらオブジェクト — 例えば上のobserved — は、それらのオブザーバにプロパティの変化について通知します。

source: Objects with a concrete type of AnyObject maintain a specific dynamic type and can be cast to that type using one of the type-cast operators (as, as?, or as!).
ja: 具象型としてAnyObjectを持つオブジェクトは、特定の動的型を保守して、その型へと型キャスト演算子（as、as?。またはas!）の１つを使ってキャストされることができます。

source: Offsets the given index by the specified distance, or so that it equals the given limiting index.
ja: 与えられたインデックスをこの指定された隔たりで補います、またはそれでそれは与えられた限界インデックスと等しくなります。

source: Offsets the given index by the specified distance.
ja: 与えられたインデックスを指定された間隔で補います。

source: Often, the optimizer can eliminate bounds checks within an array algorithm, but when that fails, invoking the same algorithm on the buffer pointer passed into your closure lets you trade safety for speed.
ja: しばしば、最適化機能は配列アルゴリズム内部で境界検査を省くことができます、しかしそれが失敗する時、同じアルゴリズムをあなたのクロージャへ渡されるバッファポインタ上で発動することは、あなたに安全をスピードと交換させます。

source: Often, the optimizer can eliminate bounds- and uniqueness-checks within an algorithm, but when that fails, invoking the same algorithm on body\ ’s argument lets you trade safety for speed.
ja: しばしば、最適化機能はアルゴリズム内部で境界および固有さ検査を省くことができます、しかしそれが失敗する時、同じアルゴリズムをbodyの引数上で発動することは、あなたに安全をスピードと交換させます。

source: Omits a specified number of elements from the base asynchronous sequence, then passes through all remaining elements.
ja: 指定された数の要素を基底非同期シーケンスから除きます、それから全ての残りの要素をずっと渡します。

source: Omits elements from the base asynchronous sequence until a given closure returns false, after which it passes through all remaining elements.
ja: 要素を基底非同期シーケンスから、ある与えられたクロージャがfalseを返すまで省きます、それの後それは全ての残りの要素をずっと渡します。

source: Omits elements from the base sequence until a given error-throwing closure returns false, after which it passes through all remaining elements.
ja: 要素を基底シーケンスから、ある与えられたエラースロークロージャがfalseを返すまで省きます、それの後それは全ての残りの要素をずっと渡します。

source: Omitting the options parameter forgoes storing the new and old property values, which causes the oldValue and newValue properties to be nil.
ja: optionsパラメータを省略することは、新しいそして古いプロパティ値を格納することをやめます、それはoldValueとnewValueプロパティがnilになる原因となります。

source: On 32-bit platforms, Int is the same size as Int32, and on 64-bit platforms, Int is the same size as Int64.
ja: 32ビットプラットホーム上では、IntはInt32と同じ大きさです、そして64ビットプラットホーム上では、IntはInt64と同じ大きさです。

source: On This Page
ja: この項には

source: On a big-endian platform, for any integer x, x == x.bigEndian.
ja: ビッグエンディアンプラットホーム上で、何らかの整数xに対して、x == x.bigEndian。

source: On a little-endian platform, for any integer x, x == x.littleEndian.
ja: リトルエンディアンプラットホーム上で、何らかの整数xに対して、x == x.littleEndian。

source: On i386 and x86_64, Float80 has a number of non-canonical encodings.
ja: i386およびx86_64では、Float80は非正準エンコーディングのある数を持ちます。

source: On platforms that flush subnormal numbers to zero (such as armv7 with the default floating-point environment), Swift interprets subnormal Float and Double values as non-canonical zeros.
ja: 非正規化数をゼロへとフラッシュするプラットホーム（たとえば省略時の浮動小数点環境でのarmv7）上では、Swiftは非正規化数FloatおよびDouble値を非正準のゼロとして解釈します。

source: On platforms that fully support IEEE 754, every Float or Double value is canonical, but non-canonical values can exist on other platforms or for other types.
ja: 完全にIEEE 754をサポートするプラットホーム上では、あらゆるFloatまたはDouble値は正準です、しかし非正準値は他のプラットホーム上でまたは他の型に対して存在できます。

source: On removal, this method invalidates all indices with respect to the dictionary.
ja: 除去において、このメソッドはこの辞書に関するすべてのインデックスを無効にします。

source: Once nil has been returned, all subsequent calls return nil.
ja: 一旦nilが返されるならば、すべての続いて起こる呼び出しはnilを返します。

source: Once again, use pattern matching to conditionally catch errors.
ja: 再び、パターンマッチを条件付きでエラーを捕まえるのに使ってください。

source: Once the predicate returns false it will not be called again.
ja: いったん述部がfalseを返すならそれは再び呼び出されません。

source: One of the values to multiply before adding to this value.
ja: この値に加えられる前に掛け合わされる値のうちの１つ。

source: Only the Optional type conforms to ExpressibleByNilLiteral.
ja: Optional型だけがExpressibleByNilLiteralに準拠します。

source: Operations on types conforming to the FloatingPoint protocol should support this behavior, but they might also support other options.
ja: FloatingPointプロトコルに準拠する型での演算はこの挙動をサポートします、しかしそれらはまた他の選択肢もサポートするかもしれません。

source: Operations with infinite values follow real arithmetic as much as possible: Adding or subtracting a finite value, or multiplying or dividing infinity by a nonzero finite value, results in infinity.
ja: 無限大値を伴う演算は、実数算術にできうる限り従います：ある無限大値を加算や減算すること、または非ゼロの有限値によって無限に乗算や除算することは、無限大の結果になります。

source: Operator
ja: 演算子

source: Operator Functions
ja: 演算子関数

source: Optimizations are sometimes applied that can reduce the amount of copying.
ja: 最適化は時折適用されて、コピー回数を減らすことができます。

source: Order Dependent Operations on Dictionary
ja: 辞書での順序依存演算

source: Other than these signaling operations, a signaling NaN behaves in the same manner as a quiet NaN.
ja: これらのシグナル演算の他は、シグナルNaNはクワイエットNaNと同じ流儀で振舞います。

source: Otherwise, next() evaluates the result with the predicate closure.
ja: そうでなければ、next()は結果をpredicateクロージャで評価します。

source: Otherwise, next() returns the result of calling the transforming closure on the received element.
ja: そうでなければ、next()は変換クロージャをその受け取った要素上で呼び出す結果を返します。

source: Otherwise, next() calls the transforming closure on the received element, returning it if the transform returns a non-nil value.
ja: そうでなければ、next()は変換クロージャをその受け取った要素上で呼び出して、その変換が非nil値を返すならばそれを返します。

source: Otherwise, next() calls the transforming closure on the received element, takes the resulting asynchronous sequence, and creates an asynchronous iterator from it.
ja: そうでなければ、next()は変換クロージャをその受け取った要素上で呼び出して、結果の非同期シーケンスをとり、そして非同期イテレータをそれから作成します。

source: Otherwise, a Unicode replacement character ("\u{FFFD}") is inserted for each detected error.
ja: そうでなければ、ユニコード代用文字（"\u{FFFD}"）が各検出エラーに対して挿入されます。

source: Otherwise, if no convention can be inferred, the method is left intact.
ja: それ以外では、推論されることができる慣行がないならば、メソッドは元のままにしておかれます。

source: Otherwise, it returns nil, ending the sequence.
ja: そうでなければ、それはnilを返します、そしてシーケンスを終わらせます。

source: Otherwise, iteration will stop if an encoding error is detected.
ja: そうでなければ、反復はエンコーディングエラーが検出されるならば停止します。

source: Otherwise, the contents are encoded as alternating key-value pairs in an unkeyed container.
ja: そうでなければ、内容は交互キー値ペアとしてキー付けされないコンテナの中にエンコードされます。

source: Overflow checking is not performed in -Ounchecked builds.
ja: オーバーフロー検査は、-Ouncheckedビルドでは実行されません。

source: Overview
ja: 概要

source: Parameters
ja: パラメータ

source: Parsing of the string is case insensitive.
ja: この文字列の構文解析は、大文字小文字に影響されません。

source: Pass true to create a signaling NaN or false to create a quiet NaN.
ja: シグナルNaNを作成するためにtrueを、またはクワイエットNaNを作成するためにfalseを渡してください。

source: Pass true to keep the existing capacity of the array after removing its elements.
ja: trueを渡すと、この配列の既存の容量をそれの要素の削除後に保持します。

source: Pass true to stop translation when an encoding error is detected in input.
ja: trueを渡すと、翻訳はエンコーディングエラーがinputにおいて検出されるときに停止します。

source: Pass a closure as combine that returns the value to use in the resulting dictionary: The closure can choose between the two values, combine them to produce a new value, or even throw an error.
ja: あるクロージャをcombineとして渡してください、それは結果の辞書において使う値を返します：そのクロージャは２つの値のどちらかを選ぶこと、それらを結合して新しい値を生成すること、またはエラーをスローすることさえ出来ます。

source: Pass a negative value as stride to create a sequence from a higher start to a lower end:
ja: 負の値をstrideとして渡して、上方から開始して下方に終わるシーケンスを作成してください：

source: Pass the greater-than operator (>) operator as the predicate.
ja: より大きい（>）演算子を述部として渡してください。

source: Passing a NaN to an operation generally results in NaN.
ja: NaNをある演算に渡すことは、一般的にNaNという結果になります。

source: Passing a sequence with duplicate keys to this initializer results in a runtime error.
ja: 重複するキーを持つシーケンスをこのイニシャライザに渡すことは、実行時エラーという結果になります。

source: Passing a sequence with no elements or an empty collection as possiblePrefix always results in true.
ja: １つの要素もないシーケンスまたは空のコレクションをpossiblePrefixとして渡すことは、常にtrueという結果になります。

source: Passing a value that can’t be represented in this type results in a runtime error.
ja: この型において表せない値を渡すことは、実行時エラーという結果になります。

source: Passing any other format or any additional characters as text results in nil.
ja: 何か他の形式または追加文字をtextとして渡すことは、nilの結果になります。

source: Passing pointers to mutable arrays of ObjC class pointers is not directly supported.
ja: ObjCクラスポインタの可変配列へポインタを渡すことは、直接にサポートされません。

source: Passing the collection’s endIndex as the start parameter results in an empty subsequence.
ja: コレクションのendIndexをstartパラメータとして渡すことは、空のシーケンスという結果になります。

source: Passing the collection’s starting index as the end parameter results in an empty subsequence.
ja: コレクションの開始インデックスをendパラメータとして渡すことは、空のシーケンスという結果になります。

source: Passing the same index as both i and j has no effect.
ja: iとjの両方と同じアンデックスを渡すことは、効果を持ちません。

source: Pattern Matching
ja: パターンマッチング

source: Perform arithmetic and bitwise operations or compare values.
ja: 算術およびビット単位の演算を実行します、または値を比較します。

source: Perform order-dependent operations common to all collections, as implemented for Dictionary.
ja: すべてのコレクションに共通の順序依存演算を、Dictionaryに対して実装されたように実行します。

source: Performing Calculations
ja: 計算の実行

source: Performing Calculations with Overflow
ja: オーバーフローを伴う計算の実行

source: Performing Collection Operations
ja: コレクション演算の実行

source: Performing Double-Width Calculations
ja: ２倍幅計算の実行

source: Performing a bitwise NOT operation on 0 returns a value with every bit set to 1.
ja: ビット単位のNOT演算を0に関して実行することは、すべてのビットが1に設定された値を返します。

source: Performing an invalid cast triggers a runtime error.
ja: 不正なキャストを行うことは実行時エラーの引き金になります。

source: Performing truncating division with floating-point values results in a truncated integer quotient and a remainder.
ja: 不動小数点値で切り捨て除算を実行することは、切り捨てられる整数指数と余りという結果になります。

source: Performs a logical AND operation on two Boolean values.
ja: 論理AND（積）演算を２つのブール値で実行します。

source: Performs a logical NOT operation on a Boolean value.
ja: 論理否定演算をあるブール値上で実行します。

source: Performs a logical OR operation on two Boolean values.
ja: 論理OR（和）演算を２つのブール値で実行します。

source: Performs a nil-coalescing operation, returning the wrapped value of an Optional instance or a default Optional value.
ja: nil合体演算を実行します、ラップされた値のOptionalインスタンスまたは省略時のOptional値を返します。

source: Performs a nil-coalescing operation, returning the wrapped value of an Optional instance or a default value.
ja: nil合体演算を実行します、ラップされた値のOptionalインスタンスまたは省略時の値を返します。

source: Performs a traditional C-style assert with an optional message.
ja: 随意のメッセージを持つ伝統的なC形式アサートを実行します。

source: Persistently unique per environment (e.g. database record keys).
ja: 環境ごとに永続的に特有である（たとえば、データベースレコードキー）。

source: Platform-specific classes, like NSBackgroundActivity, NSUserNotification, and NSXPCConnection
ja: プラットホーム特有のクラス、NSBackgroundActivity、NSUserNotification、そしてNSXPCConnectionのような

source: Playground logging can generate, at a minimum, a structured description of any type.
ja: プレイグラウンドログは、最低でも、あらゆる型の構造化された記述を生成できます。

source: Playground logging generates a richer, more specialized description of core types.
ja: プレイグラウンドログは、中心的な型のより豊かな、さらに特殊化された記述を生成します。

source: Playground logging may also be able to support specialized descriptions of other types.
ja: プレイグラウンドログはまた、他の型の特殊化された記述のサポートが可能です。

source: Positive infinity compares greater than every finite value and negative infinity, while negative infinity compares less than every finite value and positive infinity.
ja: 正の無限大はすべての有限値と負の無限大より大きいと比較されます、一方負の無限大はすべての有限値と正の無限大より小さいと比較されます。

source: Positive infinity.
ja: 正の無限大

source: Precondition: maximum must compare equal to itself (i.e. cannot be NaN).
ja: 前提条件：maximumはそれ自身と等しいと比較されなければなりません（すなわちNaNであることはできません）。

source: Precondition: minimum must compare equal to itself (i.e. cannot be NaN).
ja: 前提条件：minimumはそれ自身と等しいと比較されなければなりません（すなわちNaNであることはできません）。

source: Precondition: next() has not been applied to a copy of self since the copy was made.
ja: 前提条件：next()がselfのコピーに、そのコピーが作成されて以来まったく適用されていないこと。

source: Precondition: position indicates a valid position in self and position != endIndex.
ja: 前提条件：positionがselfの中の有効な位置を指し示してposition != endIndexであること。

source: Precondition: position is a valid position in self and position != endIndex.
ja: 前提条件：positionがselfの中の有効な位置でありposition != endIndexであること。

source: Precondition: self != nil.
ja: 前提条件：self != nil。

source: Precondition: The sequence must not have duplicate keys.
ja: 前提条件：シーケンスは重複するキーを持ってはいけません。

source: Precondition: the pointee has been initialized with an instance of type Pointee.
ja: 前提条件：pointeeが型Pointeeのインスタンスを使って初期化されていること。

source: Prefer Swift Value Types to Bridged Objective-C Reference Types
ja: Swift値型はブリッジされたObjective-C参照型より好ましい

source: Prefer this method over reduce(_:_:) for efficiency when the result is a copy-on-write type, for example an Array or Dictionary.
ja: このメソッドを、効率のためにreduce(_:_:)より優先してください、その結果がコピーオンライト型である場合、例えばArrayまたはDictionaryに対しては。

source: Preserving an Array’s Geometric Growth Strategy
ja: 配列の幾何数級的増大戦略を守る

source: Preventing Timing Problems When Using Closures
ja: クロージャを使う場合のタイミング問題を防ぐ

source: Print the result using the index found in step 2 on the original absences array.
ja: 手順２で見つけたインデックスをオリジナルabsences配列上で使って結果を出力してください。

source: Print the results using the indices found in steps 1 and 3 on the original absences array.
ja: 手順１と手順３で見つけたインデックスをオリジナルabsences配列上で使って結果を出力してください。

source: Printing and Dumping
ja: プリントとダンプ

source: Produces the next element in the compact map sequence.
ja: コンパクトマップシーケンスの中の次の要素を生じさせます。

source: Produces the next element in the drop-first sequence.
ja: drop-firstシーケンスの中の次の要素を生み出します。

source: Produces the next element in the drop-while sequence.
ja: drop-whileシーケンスの中の次の要素を生み出します。

source: Produces the next element in the filter sequence.
ja: フィルタシーケンスの中の次の要素を生み出します。

source: Produces the next element in the flat map sequence.
ja: フラットマップシーケンスの中の次の要素を生み出します。

source: Produces the next element in the map sequence.
ja: マップシーケンスの中の次の要素を生み出します。

source: Produces the next element in the prefix sequence.
ja: prefixシーケンスの中の次の要素を生み出します。

source: Produces the next element in the prefix-while sequence.
ja: prefix-whileシーケンスの中の次の要素を生み出します。

source: Producing Iterator Values
ja: イテレータ値を生み出す

source: Proper alignment ensures that the result of distance(to:) accurately measures the distance between the two pointers, counted in strides of Pointee.
ja: 適切なアライメントは、distance(to:)の結果が正確に２つのポインタの間の隔たりを、Pointeeのストライドで数えて、測ることを確実にします。

source: Protocols permit classes, structures, and enumerations to participate in inheritance, while class inheritance is only compatible with other classes.
ja: プロトコルは、クラス、構造体、そして列挙に対して継承に参加することを許可します、一方でクラス継承は他のクラスと互換性があるだけです。

source: Provide access to a shared resource using a single, shared class instance.
ja: 共有リソースへのアクセスを単一の、共有クラスインスタンスを使って提供します。

source: Providing a Hash Value
ja: ハッシュ値の提供

source: Querying Runtime Values
ja: 実行時値の問い合わせ

source: Querying a Double
ja: Doubleに問い合わせる

source: Querying a Double's State
ja: Doubleの状態を問い合わせる

source: Querying a Float
ja: Floatに問い合わせる

source: Querying a Float's State
ja: Floatの状態を問い合わせる

source: Range Expressions
ja: 範囲式

source: Range-Checked Conversion
ja: 範囲確認変換

source: Ranges
ja: さまざまな範囲

source: Raw Representation
ja: 生の表現

source: Reference Counting
ja: 参照カウント

source: Reference Types
ja: 参照型

source: Related Array Types
ja: 関連した配列型

source: Relationships
ja: 関係

source: Removes all elements from the array.
ja: 配列からすべての要素を取り除きます。

source: Removes all key-value pairs from the dictionary.
ja: すべてのキー値ペアを辞書から削除します。

source: Removes all the elements that satisfy the given predicate.
ja: 与えられた述部を満たす要素すべてを除去します。

source: Removes and returns the element at the specified position.
ja: 指定された位置での要素を削除して返します。

source: Removes and returns the first element of the collection.
ja: コレクションの最初の要素を削除して返します。

source: Removes and returns the first key-value pair of the dictionary if the dictionary isn’t empty.
ja: その辞書が空でないならば、辞書の中の最初のキー値ペアを削除して返します。

source: Removes and returns the key-value pair at the specified index.
ja: キー値ペアを指定されたインデックスで削除して返します。

source: Removes and returns the last element of the collection.
ja: コレクションの最後の要素を削除して返します。

source: Removes the elements in the specified subrange from the collection.
ja: 指定された下位範囲の中の要素をコレクションから削除します。

source: Removes the given key and its associated value from the dictionary.
ja: 指定されたキーと関連値を辞書から取り除きます。

source: Removes the given number of elements from the end of the collection.
ja: 与えられた数の要素をコレクションの終わりから削除します。

source: Removes the specified number of elements from the beginning of the collection.
ja: 指定された数の要素をコレクションの始まりから削除します。

source: Removes the specified number of elements from the end of the collection.
ja: 指定された数の要素をコレクションの終わりから削除します。

source: Removing Elements
ja: 要素の削除

source: Removing Keys and Values
ja: キーと値の削除

source: Reordering Elements
ja: 要素を再配列する

source: Reordering an Array's Elements
ja: 配列の要素を再配列します

source: Reorders the elements of the collection such that all the elements that match the given predicate are after all the elements that don’t match.
ja: コレクションの要素を再配列します、例えば、与えられた述部にマッチする要素すべてが、合致しない要素すべての後になるなど。

source: Repeatedly calling this method returns all the elements of the underlying sequence in order.
ja: 繰り返しこのメソッドを呼び出すことは、基礎をなすシーケンスのすべての要素を順番に返します。

source: Repeatedly calling this method returns, in order, all the elements of the underlying sequence.
ja: 繰り返しこのメソッドを呼び出すことは、基礎をなすシーケンスのすべての要素を、順番に返します。

source: Replaces a range of elements with the elements in the specified collection.
ja: ある範囲の要素を指定されたコレクションの要素で置き換えます。

source: Replaces the given index with its predecessor.
ja: 与えられたインデックスをそれの前のものと取り替えます。

source: Replaces the given index with its successor.
ja: 与えられたインデックスをそれの後に続くものと取り替えます。

source: Replaces the specified subrange of elements with the given collection.
ja: いくらかの要素からなる指定された下位範囲を与えられたコレクションで置き換えます。

source: Replaces this value with its additive inverse.
ja: この値をそれの加法の逆元で置き換えます。

source: Replaces this value with its square root, rounded to a representable value.
ja: この値をそれの平方根で置き換えます、表現可能な値に丸められます。

source: Replaces this value with the remainder of itself divided by the given value using truncating division.
ja: 切り捨て除算を使ってそれ自身を与えられた値で除算した余りでこの値を置き換えます。

source: Replaces this value with the remainder of itself divided by the given value.
ja: それ自身を与えられた値で除算した余りでこの値を置き換えます。

source: Represents a string literal with interpolations while it is being built up.
ja: ある文字列リテラルでいくらかの補間をもつものを、それが作り上げられている間に表します。

source: Represents the contents of a string literal with interpolations while it’s being built up.
ja: いくらかの補間をもつある文字列リテラルの内容それらを、それが作り上げられている間に表します。

source: Required.
ja: 必須。

source: Reserves enough space to store the specified number of elements.
ja: 指定された数の要素を格納するのに十分な空間を確保します。

source: Reserves enough space to store the specified number of key-value pairs.
ja: 指定された数のキー値ペアを格納するのに十分な空間を確保します。

source: Resources
ja: リソース

source: Respond to a Property Change
ja: プロパティの変更に応答する

source: Respond to events on behalf of a delegator.
ja: 委任元に代わってイベントに応答します。
